; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	spectrograph1 - mode
	image3 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star4)
	(supports instrument1 image3)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet6 thermograph2)
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Planet12 infrared0)
	(have_image Planet13 image3)
))

)

; plan
1. (turn_to satellite0 star1 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star1)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet8)
   goals met: 0 of 9
5. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 1 of 9
6. (turn_to satellite0 planet12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet12)
   goals met: 1 of 9
7. (take_image satellite0 planet12 instrument0 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 2 of 9
8. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 2 of 9
9. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon7 instrument0 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 4 of 9
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 9
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
14. (turn_to satellite0 star2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star2)
   goals met: 4 of 9
15. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 4 of 9
16. (turn_to satellite0 planet11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet11)
   goals met: 4 of 9
17. (take_image satellite0 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 5 of 9
18. (turn_to satellite0 planet13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet13)
   goals met: 5 of 9
19. (take_image satellite0 planet13 instrument1 image3)
   added: (have_image planet13 image3)
   goals met: 6 of 9
20. (turn_to satellite0 planet6 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet6)
   goals met: 6 of 9
21. (take_image satellite0 planet6 instrument1 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 7 of 9
22. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 7 of 9
23. (take_image satellite0 planet9 instrument1 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 8 of 9
24. (turn_to satellite0 star4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star4)
   goals met: 9 of 9
